# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
 
# Parameters
nc: 50 # number of herb classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs
 
# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2_WTConv, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2_WTConv, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_WTConv, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2_WTConv, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, LSKA, [1024]] # 10
  - [-1, 2, C2PSA, [1024]] # 11

# YOLOv8.0n head
head:
  - [4, 1, Conv, [256]]  # 12-P3/8
  - [6, 1, Conv, [256]]  # 13-P4/16
  - [9, 1, Conv, [256]]  # 14-P5/32

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15 P5->P4
  - [[-1, 11], 1, SDI, []] # 16
  - [-1, 3, C3k2_SCConv, [256]] # 17-P4/16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 18 P4->P3
  - [[-1, 10], 1, SDI, []] # 19
  - [-1, 3, C3k2_SCConv, [256]] # 20-P3/8s

  - [1, 1, Conv, [256, 3, 2]] # 21 P2->P3
  - [[-1, 10, 18], 1, SDI, []] # 22
  - [-1, 3, C3k2_SCConv, [256]] # 23-P3/8

  - [-1, 1, Conv, [256, 3, 2]] # 24 P3->P4
  - [[-1, 11, 15], 1, SDI, []] # 25
  - [-1, 3, C3k2_SCConv, [512]] # 26-P4/16

  - [-1, 1, Conv, [256, 3, 2]] # 27 P4->P5
  - [[-1, 12], 1, SDI, []] # 28
  - [-1, 3, C3k2_SCConv, [1024]] # 29-P5/32

  - [[21, 24, 27], 1, Detect, [nc]]  # Detect(P3, P4, P5)


